productos.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ns1="urn:ConsultarSucursales"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://xml.apache.org/xml-soap"
    xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:enc="http://www.w3.org/2003/05/soap-encoding">
    <env:Header>
        <ns3:Security env:mustUnderstand="true">
            <ns3:UsernameToken>
                <ns3:Username></ns3:Username>
                <ns3:Password></ns3:Password>
            </ns3:UsernameToken>
        </ns3:Security>
    </env:Header>
    <env:Body>
        <ns1:ConsultarSucursales env:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
            <Consulta xsi:type="ns2:Map">
                <item>
                    <key xsi:type="xsd:string">consulta</key>
                    <value xsi:type="ns2:Map">
                        <item>
                            <key xsi:type="xsd:string">Localidad</key>
                            <value xsi:type="xsd:string"></value>
                        </item>
                        <item>
                            <key xsi:type="xsd:string">CodigoPostal</key>
                            <value xsi:type="xsd:string"></value>
                        </item>
                        <item>
                            <key xsi:type="xsd:string">Provincia</key>
                            <value xsi:type="xsd:string"></value>
                        </item>
                    </value>
                </item>
            </Consulta>
        </ns1:ConsultarSucursales>
    </env:Body>
</env:Envelope>